Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum
Special load case numbers for min/max queries.
Get the value from the load case with the maximum absolute value (whether positive or negative).
AnalysisResult.LoadCase = (int)AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_ABSOLUTE_VALUE;
Get the shear value from the load case with the minimum axial force value.
AnalysisResult.ValueType = AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y;
AnalysisResult.LoadCase = (int)AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_FX_VALUE;

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_VALUE
The load case with the minimum signed value of the queried value type.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_VALUE
The load case with the maximum signed value of the queried value type.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_ABSOLUTE_VALUE
The load case with the maximum absolute value of the queried value type.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_FX_VALUE
The load case with the maximum axial (FX) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_FX_VALUE
The load case with the minimum axial (FX) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_FY_VALUE
The load case with the maximum shear Y (FY) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_FY_VALUE
The load case with the minimum shear Y (FY) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_FZ_VALUE
The load case with the maximum shear Z (FZ) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_FZ_VALUE
The load case with the minimum shear Z (FZ) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_MX_VALUE
The load case with the maximum torsional moment (MX) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_MX_VALUE
The load case with the minimum torsional moment (MX) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_MY_VALUE
The load case with the maximum bending moment Y (MY) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_MY_VALUE
The load case with the minimum bending moment Y (MY) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_MZ_VALUE
The load case with the maximum bending moment Z (MZ) value.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_MZ_VALUE
The load case with the minimum bending moment Z (MZ) value.